{
  "backend/main.mo": "Main backend actor defining data types (Equipment, SparePart, CataloguingRecord, MaintenanceRecord, Document, UserProfile) and CRUD operations with access control, including equipment management, spare parts linking, cataloguing, maintenance, and document handling.",
  "feature_evidence.json": "Feature evidence report documenting implemented cataloguing module features including Excel import for attribute templates, spare part master form with noun-modifier selection, autocomplete spare part lookup, attribute editing, and equipment linking interfaces.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages (Equipment, Spare Parts, Cataloguing, Maintenance, Documents, Reports), components (PageLayout, FormField, EquipmentLookup), hooks (useQueries), and utility libraries (dates, exports, validation, cataloguingTemplates).",
  "frontend/DRAFT_REBUILD_TRIGGER.md": "Marker file used to trigger fresh draft builds and deployments without modifying application functionality or UI behavior.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like background, foreground, primary, secondary, muted, accent, destructive, borders, and sidebar components.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and root div for mounting the app.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with routes for Equipment Master, Equipment List, Spare Parts, Cataloguing, Maintenance, Documents, Reports, Import, and Global Search pages, wrapped with ThemeProvider and Toaster.",
  "frontend/src/components/AccessControlInitBanner.tsx": "Empty component file for access control initialization banner (no implementation present).",
  "frontend/src/components/AttributeTemplateImport.tsx": "Component for importing Excel attribute templates with drag-and-drop file upload, progress tracking, file validation, and integration with backend import mutation (backend method pending implementation).",
  "frontend/src/components/AutocompleteTextInput.tsx": "Reusable autocomplete text input component with portaled dropdown, keyboard navigation, and click handling that filters suggestions based on user input and prevents clipping by parent containers.",
  "frontend/src/components/ConfirmDialog.tsx": "Reusable confirmation dialog component wrapping AlertDialog with customizable title, description, button text, and optional destructive styling for dangerous actions.",
  "frontend/src/components/EquipmentLookup.tsx": "Equipment selection component with a native select dropdown and filterable overlay that searches by equipment number, tag number, or name using data from useGetAllEquipment hook.",
  "frontend/src/components/EquipmentNameDropdown.tsx": "Equipment name dropdown using AutocompleteTextInput with static EQUIPMENT_NAMES suggestions list, supporting both selection and free-text entry.",
  "frontend/src/components/forms/FormField.tsx": "Reusable form field wrapper component that displays a label with optional required indicator, help text, and error messages for form inputs.",
  "frontend/src/components/GlobalSearch.tsx": "Global search interface with debounced search input, collapsible filters, sorting controls, and displays filtered/sorted results for both equipment and spare parts with active filter badges.",
  "frontend/src/components/GlobalSearchFilters.tsx": "Filter controls component for global search providing result type, discipline, equipment type, and date range filters with session storage persistence.",
  "frontend/src/components/HeaderAuthControl.tsx": "Authentication button component managing Internet Identity login/logout with loading states, error handling, and query cache clearing on logout.",
  "frontend/src/components/PageLayout.tsx": "Main page layout wrapper providing header with navigation, authentication control, responsive mobile menu, main content area, and footer with branding.",
  "frontend/src/components/SparePartAdvancedSearch.tsx": "Provides a multi-criteria search interface for spare parts with debounced filtering across equipment number, tag, part number, name, description, model, and serial fields. Displays search results in a table with badges and handles loading/error states.",
  "frontend/src/components/SparePartEquipmentLinks.tsx": "Manages the many-to-many relationship between spare parts and equipment, allowing users to link/unlink equipment to a spare part with confirmation dialogs and displaying linked equipment in a table.",
  "frontend/src/components/SparePartLookup.tsx": "A dropdown component for selecting spare parts with filtering by part number, name, manufacturer part number, or description. Uses a native select element with an overlay filter input.",
  "frontend/src/components/SparePartMasterForm.tsx": "Form for creating and editing spare parts using noun-modifier-attribute taxonomy with auto-generated descriptions. Supports both create and edit modes with equipment linking functionality.",
  "frontend/src/components/SparePartNameDropdown.tsx": "Autocomplete dropdown for spare part names using a static suggestion list from SPARE_PART_NAMES constant. Supports free-text entry with portaled overlay to prevent clipping.",
  "frontend/src/components/SparePartNumberLookup.tsx": "Search input with dropdown for finding spare parts by part number or description, featuring keyboard navigation (arrow keys, Enter, Escape) and click-outside-to-close behavior.",
  "frontend/src/hooks/useActor.ts": "Custom React Query hook that manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useDebounce.ts": "Custom React hook that debounces a value by delaying its update until after a specified delay period has passed without changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including equipment, spare parts, cataloguing records, maintenance records, documents, and user profiles with mutations and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components like backgrounds, borders, primary/secondary colors, and chart colors.",
  "frontend/src/lib/cataloguingTemplates.ts": "Defines discipline-specific cataloguing templates (mechanical, electrical, instrumentation, piping) with predefined fields and types for equipment data entry.",
  "frontend/src/lib/csvImport.ts": "Provides CSV parsing utilities with quote handling, validation functions for equipment and spare part rows, and helper functions to parse dates and BigInt values from CSV data.",
  "frontend/src/lib/dates.ts": "Utility functions to format BigInt nanosecond timestamps to readable date strings and convert date strings to BigInt nanosecond timestamps.",
  "frontend/src/lib/descriptionGenerator.ts": "Generates concise spare part descriptions by combining noun, modifier, and prioritized attributes with a 200-character limit.",
  "frontend/src/lib/disciplines.ts": "Provides engineering discipline enum mappings with conversion functions between EngineeringDiscipline enum values and human-readable labels.",
  "frontend/src/lib/errors.ts": "Normalizes backend errors into user-friendly messages, extracting meaningful error text from canister traps, reject codes, and authentication failures with helper functions to identify error types.",
  "frontend/src/lib/exports.ts": "Provides functions to export data to CSV and PDF formats, and download CSV templates. Includes manual PDF generation using raw PDF syntax.",
  "frontend/src/lib/files.ts": "Utilities for converting browser File objects to ExternalBlob with upload progress tracking, and formatting file sizes for display.",
  "frontend/src/lib/filtering.ts": "Filters equipment and spare parts based on discipline, equipment type, and date range criteria from FilterState.",
  "frontend/src/lib/importMappings.ts": "Defines CSV template headers and mapping functions to convert CSV row data into equipment and spare part objects with type conversions.",
  "frontend/src/lib/productionChecks.ts": "Runtime validation functions to verify backend canister has required methods deployed, helping diagnose production configuration issues.",
  "frontend/src/lib/sorting.ts": "Sorts equipment and spare parts by relevance, name, number, or date with configurable direction, including relevance scoring for search terms.",
  "frontend/src/lib/staticNameLists.ts": "Static sorted lists of common equipment and spare part names for autocomplete dropdown suggestions.",
  "frontend/src/lib/validation.ts": "Validation functions for required fields, numbers, emails, and custom attribute values with type-specific and rule-based validation.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/CataloguingPage.tsx": "Cataloguing module page with tabs for attribute template import, spare part master form, and advanced search; shows warning that backend implementation is pending.",
  "frontend/src/pages/DocumentsPage.tsx": "Documents management page that displays a placeholder message indicating the feature requires backend methods not yet implemented.",
  "frontend/src/pages/EquipmentListPage.tsx": "Displays a filterable table of equipment with search, discipline filtering, and inline edit/delete capabilities. Includes authentication checks and uses React Query hooks for CRUD operations.",
  "frontend/src/pages/EquipmentMasterPage.tsx": "Form page for creating new equipment entries with fields for name, tag number, location, manufacturer, model, serial number, dates, and discipline. Handles authentication, form validation, and displays next available equipment number.",
  "frontend/src/pages/GlobalSearchPage.tsx": "Wrapper page that renders the GlobalSearch component for searching across equipment and spare parts. Requires authentication and shows loading/login states.",
  "frontend/src/pages/ImportPage.tsx": "Bulk import page supporting CSV uploads for equipment and spare parts with preview, validation, template download, and batch creation. Includes actor initialization tracking and error handling for backend connectivity.",
  "frontend/src/pages/MaintenancePage.tsx": "Placeholder page indicating maintenance records feature is not yet implemented, listing required backend methods (createMaintenanceRecord, deleteMaintenanceRecord).",
  "frontend/src/pages/ReportsPage.tsx": "Multi-tab reporting page displaying equipment lists, spare parts, and maintenance due records with CSV and PDF export capabilities. Uses equipment lookup and aggregates maintenance data from multiple sources.",
  "frontend/src/pages/SparePartsPage.tsx": "Comprehensive spare parts management page with tabs for creating new parts, linking existing parts to equipment, viewing parts by equipment, and searching. Supports file attachments, CRUD operations, and viewing equipment usage relationships.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, custom animations (accordion), typography, and container query plugins.",
  "project_state.json": "Project state tracking document for a Cataloguing Module with Spare Part Master using Noun-Modifier classification, listing 8 existing features (REQ-11 through REQ-18) covering Excel import, dynamic attribute loading, equipment linking, and search capabilities."
}