{
  "backend/main.mo": "Main backend actor defining all data types (Equipment, SparePart, MaintenanceRecord, Document, CataloguingRecord, AttributeTemplate, UserProfile) and state maps, with access control integration via MixinAuthorization and blob storage via MixinStorage.",
  "backend/migration.mo": "Migration module with placeholder types and a run function that currently returns an empty object for actor state migration.",
  "feature_evidence.json": "Feature evidence report documenting the admin role checking logic for the attribute template import interface in CataloguingPage, with high confidence and references to relevant frontend files and components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages, components, and hooks, with detailed descriptions of authentication, admin role checking (useIsCallerAdmin), form handling, and data management features.",
  "frontend/DRAFT_REBUILD_TRIGGER.md": "Timestamp file used solely to trigger fresh draft builds without modifying application functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements like backgrounds, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point with viewport meta tag, app title describing all screens, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with routes for all pages (equipment, spare parts, cataloguing, maintenance, documents, reports, import, search), wrapped in ThemeProvider and Toaster.",
  "frontend/src/components/AccessControlInitBanner.tsx": "Empty component file for access control initialization banner (no implementation present).",
  "frontend/src/components/AttributeTemplateImport.tsx": "Admin-only component for uploading Excel attribute templates with drag-and-drop support, progress tracking, file validation, and detailed inline documentation explaining the admin role enforcement at both UI and backend levels.",
  "frontend/src/components/AutocompleteTextInput.tsx": "Reusable autocomplete text input with portaled dropdown to prevent clipping, keyboard navigation, filtering, and click-outside handling for suggestion selection.",
  "frontend/src/components/ConfirmDialog.tsx": "A reusable confirmation dialog component built with AlertDialog that supports customizable title, description, confirm/cancel text, and optional destructive styling.",
  "frontend/src/components/EquipmentLookup.tsx": "Equipment selection component with a dropdown and filterable overlay that allows searching equipment by number, tag number, or name with real-time filtering.",
  "frontend/src/components/EquipmentNameDropdown.tsx": "Equipment name dropdown using a static list of equipment names (EQUIPMENT_NAMES) with autocomplete functionality and free-typing support.",
  "frontend/src/components/forms/FormField.tsx": "Reusable form field wrapper component that displays a label, optional required indicator, children input elements, help text, and validation error messages.",
  "frontend/src/components/GlobalSearch.tsx": "Main global search component that searches both equipment and spare parts with debounced input, filtering, sorting, and collapsible filter panel with session storage persistence.",
  "frontend/src/components/GlobalSearchFilters.tsx": "Filter panel component for global search providing discipline, equipment type, date range, and result type filters with controlled state management.",
  "frontend/src/components/HeaderAuthControl.tsx": "Authentication control button for Internet Identity login/logout with loading states, error handling, and query cache clearing on logout.",
  "frontend/src/components/PageLayout.tsx": "Main page layout wrapper providing header with navigation, authentication control, responsive mobile menu, and footer with branding.",
  "frontend/src/components/SparePartAdvancedSearch.tsx": "Advanced spare parts search interface with multiple filter fields (equipment no, tag no, part number, etc.) and results table display.",
  "frontend/src/components/SparePartEquipmentLinks.tsx": "Manages equipment links for a spare part, displaying linked equipment in a table and providing UI to add/remove equipment associations with confirmation dialogs and toast notifications.",
  "frontend/src/components/SparePartLookup.tsx": "Provides a dropdown select component for choosing spare parts with filtering capabilities by part number, name, manufacturer part number, or description.",
  "frontend/src/components/SparePartMasterForm.tsx": "Main form for creating and editing spare parts with noun/modifier selection, dynamic attribute fields, auto-generated descriptions, validation, and integration with SparePartEquipmentLinks component.",
  "frontend/src/components/SparePartNameDropdown.tsx": "Autocomplete dropdown for spare part names using a static suggestion list (SPARE_PART_NAMES) with free-typing support via AutocompleteTextInput component.",
  "frontend/src/components/SparePartNumberLookup.tsx": "Search input with dropdown for looking up spare parts by part number or description, featuring keyboard navigation and click-outside-to-close behavior.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating queries on actor changes.",
  "frontend/src/hooks/useDebounce.ts": "Custom hook that debounces a value by delaying updates until a specified delay period has passed without changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for all backend data operations including user profiles, roles, equipment, spare parts, maintenance records, documents, and cataloguing with mutations and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes including primary, secondary, muted, destructive, and chart colors.",
  "frontend/src/lib/cataloguingTemplates.ts": "Defines predefined field templates for different equipment types (mechanical, electrical, instrumentation, piping) with field types and validation options.",
  "frontend/src/lib/csvImport.ts": "CSV parsing utilities with validation functions for equipment and spare part imports, including date and bigint conversion helpers.",
  "frontend/src/lib/dates.ts": "Date formatting utilities that convert between bigint nanosecond timestamps and human-readable date strings.",
  "frontend/src/lib/descriptionGenerator.ts": "Generates concise spare part descriptions by combining noun, modifier, and key attributes with prioritization of common fields.",
  "frontend/src/lib/disciplines.ts": "Engineering discipline enum mappings and conversion utilities between EngineeringDiscipline enum values and display labels.",
  "frontend/src/lib/errors.ts": "Error handling utilities that safely extract and normalize error messages from various sources, with special handling for backend trap errors and authentication issues.",
  "frontend/src/lib/exports.ts": "Provides functions to export data to CSV and PDF formats, and download CSV templates. Includes manual PDF generation using raw PDF syntax for creating simple tabular reports.",
  "frontend/src/lib/files.ts": "Utility functions for file handling: converts browser File objects to ExternalBlob with optional upload progress tracking, and formats file sizes into human-readable strings.",
  "frontend/src/lib/filtering.ts": "Implements filtering logic for equipment and spare parts based on discipline, equipment type, and date range. Spare parts are excluded when equipment type filter is active.",
  "frontend/src/lib/importMappings.ts": "Defines CSV import templates and mapping functions for equipment and spare parts, handling various column name variations and converting string data to appropriate types including dates and disciplines.",
  "frontend/src/lib/productionChecks.ts": "Runtime validation functions to verify backend canister has required methods deployed, helping diagnose production deployment issues by checking for missing API methods.",
  "frontend/src/lib/sorting.ts": "Implements sorting logic for equipment and spare parts by relevance, name, number, or date with configurable direction. Relevance scoring prioritizes exact matches, prefix matches, and substring matches.",
  "frontend/src/lib/staticNameLists.ts": "Provides static sorted lists of common equipment and spare part names (valves, pumps, transmitters, etc.) for autocomplete dropdown suggestions.",
  "frontend/src/lib/validation.ts": "Form validation utilities that validate attribute values against type definitions (int, float, bool, string, dropdown) and check required fields, length constraints, patterns, and allowed options.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/CataloguingPage.tsx": "Provides a tabbed interface for spare part cataloguing with noun-modifier classification, including attribute template import (admin-only), spare part master form, and advanced search. Uses role-based access control via useIsCallerAdmin hook to restrict template import to administrators.",
  "frontend/src/pages/DocumentsPage.tsx": "Placeholder page for document management feature that displays a \"not available\" message and lists required backend methods (createDocument, uploadDocument, updateDocumentMetadata) that are not yet implemented.",
  "frontend/src/pages/EquipmentListPage.tsx": "Displays a searchable and filterable table of all equipment with inline edit and delete functionality. Includes authentication checks, discipline filtering, search across multiple fields, and confirmation dialogs for destructive actions.",
  "frontend/src/pages/EquipmentMasterPage.tsx": "Main equipment creation form with fields for equipment details, manufacturer info, dates, and engineering discipline selection. Handles form submission with authentication checks, error normalization, and displays next available equipment number.",
  "frontend/src/pages/GlobalSearchPage.tsx": "Wrapper page for the GlobalSearch component that searches across equipment and spare parts. Requires authentication and displays appropriate loading or login prompts.",
  "frontend/src/pages/ImportPage.tsx": "Provides CSV import functionality for both equipment and spare parts with file validation, preview, template download, and batch processing. Includes actor initialization tracking, error handling, and detailed import result reporting.",
  "frontend/src/pages/MaintenancePage.tsx": "Placeholder page for maintenance records feature that displays a \"not available\" message and lists required backend methods (createMaintenanceRecord, deleteMaintenanceRecord) that are not yet implemented.",
  "frontend/src/pages/ReportsPage.tsx": "Reports page component that displays equipment, spare parts, and maintenance due reports in tabbed views with CSV and PDF export functionality. Uses equipment lookup and various query hooks to fetch and display data in tables.",
  "frontend/src/pages/SparePartsPage.tsx": "Spare parts management page with create/link modes, search functionality, and equipment association features. Handles CRUD operations for spare parts with authentication checks, file attachments, and displays equipment usage relationships.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing. Provides sessionStorage persistence for parameters and functions to clear sensitive data from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, custom animations, and typography/container-queries plugins. Defines design tokens for borders, colors, shadows, and component styling.",
  "project_state.json": "Project metadata tracking architectural notes, features, and requirements. Currently focused on displaying admin role checking logic in CataloguingPage and backend admin role implementation from main.mo."
}