{
  "backend/main.mo": "Main canister implementing asset management logic with equipment, spare parts, cataloguing, maintenance, documents, user profiles, and access control storage and helpers.",
  "backend/migration.mo": "Migration module passing old userProfiles map through unchanged since the schema remains identical.",
  "feature_evidence.json": "Feature evidence report linking a draft rebuild trigger to related files, components, and tests.",
  "frontend-file-summaries.txt": "Aggregated summaries of all frontend source files for quick reference during build planning.",
  "frontend/DRAFT_REBUILD_TRIGGER.md": "Dummy file used only to force creation of a new draft deployment without functional changes.",
  "frontend/index.css": "Tailwind CSS base styles and theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "React router setup defining all app routes and wrapping the UI with ThemeProvider and Toaster.",
  "frontend/src/components/AccessControlInitBanner.tsx": "Empty placeholder component file.",
  "frontend/src/components/AutocompleteTextInput.tsx": "Autocomplete text input with portaled dropdown, filtering, focus handling, and keyboard navigation.",
  "frontend/src/components/ConfirmDialog.tsx": "Reusable confirmation dialog component wrapping alert‑dialog UI with customizable text and actions.",
  "frontend/src/components/EquipmentLookup.tsx": "Dropdown with searchable filtering for selecting equipment by number, tag, or name using equipment data from useGetAllEquipment.",
  "frontend/src/components/EquipmentNameDropdown.tsx": "Autocomplete text input for equipment names using a static suggestion list.",
  "frontend/src/components/forms/FormField.tsx": "Generic form field wrapper displaying label, children, help text, and errors.",
  "frontend/src/components/HeaderAuthControl.tsx": "Login/logout button managing Internet Identity authentication with status handling and error toasts.",
  "frontend/src/components/PageLayout.tsx": "Page wrapper providing header, footer, and main content layout with auth control.",
  "frontend/src/components/SparePartNameDropdown.tsx": "Autocomplete text input for spare part names using a static suggestion list.",
  "frontend/src/hooks/useActor.ts": "Retrieves and manages a backend actor tied to the current identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout functions, and initializes identity from storage.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating equipment and related backend data using the actor.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for theming including dark mode.",
  "frontend/src/lib/cataloguingTemplates.ts": "Defines cataloguing templates by discipline and returns template fields by name.",
  "frontend/src/lib/csvImport.ts": "Parses CSV text into objects, validates equipment and spare part rows, and provides date/bigint parsing helpers.",
  "frontend/src/lib/dates.ts": "Formats bigint timestamps to readable dates and converts date strings to bigint nanoseconds.",
  "frontend/src/lib/disciplines.ts": "Defines engineering discipline options and maps between enum values and labels.",
  "frontend/src/lib/errors.ts": "Normalizes backend errors into user-friendly messages and detects authentication or config issues.",
  "frontend/src/lib/exports.ts": "Exports data to CSV or PDF and provides a CSV template download utility.",
  "frontend/src/lib/files.ts": "Converts browser File objects to ExternalBlob and formats file sizes.",
  "frontend/src/lib/importMappings.ts": "Maps imported CSV rows to equipment or spare part objects, applying type conversions and discipline mapping.",
  "frontend/src/lib/productionChecks.ts": "Checks backend actor for required methods and throws or returns messages if methods are missing.",
  "frontend/src/lib/staticNameLists.ts": "Provides sorted static lists of equipment and spare part names for autocomplete.",
  "frontend/src/lib/validation.ts": "Basic validators for required fields, numbers, and email format.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/CataloguingPage.tsx": "UI for creating, editing, and deleting cataloguing records with equipment lookup and form handling.",
  "frontend/src/pages/DocumentsPage.tsx": "Provides UI to upload, list, edit, and delete equipment-linked documents with progress tracking and dialogs.",
  "frontend/src/pages/EquipmentListPage.tsx": "Displays searchable/filterable equipment list and supports editing and deleting equipment via dialogs.",
  "frontend/src/pages/EquipmentMasterPage.tsx": "Form page for creating new equipment records with validation and backend integration.",
  "frontend/src/pages/ImportPage.tsx": "Handles CSV import for equipment and spare parts, including preview, validation, and bulk creation.",
  "frontend/src/pages/MaintenancePage.tsx": "Manages creation, viewing, editing, and deletion of maintenance records tied to equipment.",
  "frontend/src/pages/ReportsPage.tsx": "Implements a reports page that fetches equipment, spare parts, and maintenance data and provides CSV/PDF export functions for each report type.",
  "frontend/src/pages/SparePartsPage.tsx": "Provides a UI to create, edit, delete, search, and view spare parts with file attachments and equipment association, including dialogs and form handling.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, container settings, animations, and plugin integrations.",
  "project_state.json": "Defines project metadata, current features, and state information for the Maintenance Hub project."
}