{
  "backend/main.mo": "Main backend actor defining data types (Equipment, SparePart, CataloguingRecord, MaintenanceRecord, Document, UserProfile) and storage maps with access control, user profiles, and engineering discipline utilities.",
  "feature_evidence.json": "Feature evidence report documenting two features: dynamic spare part form rendering based on uploaded attribute definitions (REQ-21) and connecting AttributeTemplateImport to use uploaded files instead of static templates (REQ-22).",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages, components, hooks, and utilities with details on authentication, form handling, data types, and query operations.",
  "frontend/DRAFT_REBUILD_TRIGGER.md": "Marker file with timestamp used to trigger fresh draft builds without modifying application functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors including sidebar, charts, and UI component tokens.",
  "frontend/index.html": "HTML entry point with viewport meta tags and root div for React app mounting, titled 'Asset Management App'.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for equipment, spare parts, cataloguing, maintenance, documents, reports, import, and global search, wrapped in ThemeProvider and Toaster.",
  "frontend/src/components/AccessControlInitBanner.tsx": "Empty component file for access control initialization banner (no implementation present).",
  "frontend/src/components/AttributeTemplateImport.tsx": "Component for uploading Excel files containing attribute definitions with drag-and-drop support, file validation, progress tracking, and integration with useImportAttributeTemplate mutation.",
  "frontend/src/components/AutocompleteTextInput.tsx": "Reusable autocomplete text input with portaled dropdown, keyboard navigation, filtered suggestions, and click-outside handling to prevent clipping issues.",
  "frontend/src/components/ConfirmDialog.tsx": "A reusable confirmation dialog component built on AlertDialog that supports customizable title, description, confirm/cancel text, and optional destructive styling.",
  "frontend/src/components/EquipmentLookup.tsx": "Equipment selection component with a dropdown select and filterable overlay that searches by equipment number, tag number, or name, supporting bigint IDs.",
  "frontend/src/components/EquipmentNameDropdown.tsx": "Equipment name input component using AutocompleteTextInput with static EQUIPMENT_NAMES suggestions and free-typing support.",
  "frontend/src/components/forms/FormField.tsx": "Reusable form field wrapper component that displays label, required indicator, help text, error messages, and child input elements.",
  "frontend/src/components/GlobalSearch.tsx": "Global search interface for equipment and spare parts with debounced search, collapsible filters, sorting controls, and session-persisted filter state.",
  "frontend/src/components/GlobalSearchFilters.tsx": "Filter panel component for global search supporting discipline, equipment type, date range, and result type filters with controlled state management.",
  "frontend/src/components/HeaderAuthControl.tsx": "Authentication control button for Internet Identity login/logout with loading states, error handling, and query cache clearing on logout.",
  "frontend/src/components/PageLayout.tsx": "Main application layout component with header navigation, responsive mobile menu, authentication control, and footer with branding.",
  "frontend/src/components/SparePartAdvancedSearch.tsx": "Advanced spare parts search interface with multiple filter fields (equipment no, tag, part number, etc.), debounced queries, and results table display.",
  "frontend/src/components/SparePartEquipmentLinks.tsx": "Displays and manages equipment links for a spare part, allowing users to add/remove equipment associations with confirmation dialogs and toast notifications.",
  "frontend/src/components/SparePartLookup.tsx": "Provides a searchable dropdown for selecting spare parts, filtering by part number, name, manufacturer part number, or description with a scrollable overlay.",
  "frontend/src/components/SparePartMasterForm.tsx": "Main form for creating or editing spare parts with noun/modifier selection, dynamic attribute fields, auto-generated descriptions, and validation.",
  "frontend/src/components/SparePartNameDropdown.tsx": "Autocomplete dropdown for spare part names using a static suggestion list with free-typing support via AutocompleteTextInput component.",
  "frontend/src/components/SparePartNumberLookup.tsx": "Searchable lookup component for spare parts by number or description with keyboard navigation and dropdown selection.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages backend actor creation with Internet Identity authentication, admin token initialization, and query invalidation on identity changes.",
  "frontend/src/hooks/useDebounce.ts": "Custom hook that debounces a value by delaying updates until after a specified delay period has elapsed.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for all backend operations including user profiles, equipment, spare parts, cataloguing records, maintenance records, and documents with CRUD operations and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components like primary, secondary, destructive, borders, and charts.",
  "frontend/src/lib/cataloguingTemplates.ts": "Defines cataloguing templates for different equipment types (mechanical, electrical, instrumentation, piping) with predefined fields and input types for structured data entry.",
  "frontend/src/lib/csvImport.ts": "CSV parsing utilities with validation functions for equipment and spare part rows, including helpers for parsing dates and BigInt values from CSV data.",
  "frontend/src/lib/dates.ts": "Date formatting utilities to convert between bigint nanosecond timestamps and human-readable date strings or Date objects.",
  "frontend/src/lib/descriptionGenerator.ts": "Generates concise spare part descriptions by combining noun, modifier, and key attributes with prioritization of common fields like size, material, and type.",
  "frontend/src/lib/disciplines.ts": "Engineering discipline enum mappings and conversion utilities between EngineeringDiscipline enum values and human-readable labels (MECHANICAL, ELECTRICAL, INSTRUMENTATION, PIPING).",
  "frontend/src/lib/errors.ts": "Error normalization and extraction utilities that parse backend trap errors, canister rejection codes, and authentication errors into user-friendly messages.",
  "frontend/src/lib/exports.ts": "Provides functions to export data to CSV and PDF formats, and download CSV templates. Includes manual PDF generation using raw PDF syntax.",
  "frontend/src/lib/files.ts": "Utility functions for converting browser File objects to ExternalBlob with upload progress tracking, and formatting file sizes for display.",
  "frontend/src/lib/filtering.ts": "Filters equipment and spare parts based on discipline, equipment type, and date range criteria from FilterState.",
  "frontend/src/lib/importMappings.ts": "Defines CSV template headers and mapping functions to convert CSV row data into Equipment and SparePart objects with flexible column name matching.",
  "frontend/src/lib/productionChecks.ts": "Runtime validation functions to verify backend canister has required methods, helping diagnose production deployment issues.",
  "frontend/src/lib/sorting.ts": "Implements sorting logic for equipment and spare parts by relevance, name, number, or date with configurable direction and relevance scoring.",
  "frontend/src/lib/staticNameLists.ts": "Provides static sorted lists of common equipment and spare part names for autocomplete dropdown suggestions.",
  "frontend/src/lib/validation.ts": "Validates attribute values against definitions including type checking, required fields, min/max constraints, and regex patterns parsed from validation rule strings.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/CataloguingPage.tsx": "Cataloguing module page with tabs for importing attribute templates, managing spare part master data, and advanced search functionality. Shows authentication requirement and backend update notice.",
  "frontend/src/pages/DocumentsPage.tsx": "Placeholder page for document management feature that displays an alert indicating the feature requires backend methods (createDocument, uploadDocument, updateDocumentMetadata) not yet implemented.",
  "frontend/src/pages/EquipmentListPage.tsx": "Equipment list view page with search, filtering by discipline, and CRUD operations (edit/delete). Includes authentication checks, inline editing dialog, and confirmation dialog for deletions.",
  "frontend/src/pages/EquipmentMasterPage.tsx": "Main equipment creation page with a form for adding new equipment records and navigation cards to other features (list, spare parts, maintenance, documents, reports, import). Handles authentication and displays next equipment number.",
  "frontend/src/pages/GlobalSearchPage.tsx": "Global search page that renders the GlobalSearch component for authenticated users, or displays a login prompt for unauthenticated users.",
  "frontend/src/pages/ImportPage.tsx": "CSV import page supporting bulk equipment and spare parts creation with file upload, preview, validation, template download, and batch processing with progress tracking and error reporting.",
  "frontend/src/pages/MaintenancePage.tsx": "Placeholder page for maintenance records feature that displays an alert indicating the feature requires backend methods (createMaintenanceRecord, deleteMaintenanceRecord) not yet implemented.",
  "frontend/src/pages/ReportsPage.tsx": "Reports page with tabbed views for equipment list, spare parts, and maintenance due reports, featuring equipment lookup, data tables, and CSV/PDF export functionality for each report type.",
  "frontend/src/pages/SparePartsPage.tsx": "Main spare parts management page component with tabs for creating/linking parts, search functionality, equipment association, and CRUD operations using React hooks and UI components.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, typography, animations, and design tokens for the application's styling system.",
  "project_state.json": "Project metadata tracking architectural state, features, and pending requirements for implementing dynamic attribute field rendering from uploaded Excel files for spare part cataloguing."
}