{
  "backend/main.mo": "Motoko canister defining user profiles and CRUD logic for equipment, spare parts, cataloguing, maintenance, and documents with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test requirements.",
  "frontend-file-summaries.txt": "Text file containing short descriptions of all major frontend components and pages.",
  "frontend/index.css": "Tailwind base theme defining OKLCH color variables for light and dark mode along with global styles.",
  "frontend/index.html": "HTML entry point that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for all app pages and wraps the UI with theme and toast providers.",
  "frontend/src/components/ConfirmDialog.tsx": "Reusable confirmation dialog component for delete and confirmation actions using shadcn AlertDialog.",
  "frontend/src/components/EquipmentLookup.tsx": "Dropdown component fetching equipment list and allowing selection by equipment number.",
  "frontend/src/components/forms/FormField.tsx": "Reusable form field wrapper that renders labels, inputs, help text, and validation errors.",
  "frontend/src/components/PageLayout.tsx": "Page layout wrapper providing header, main content area, and footer with caffeine.ai attribution.",
  "frontend/src/hooks/useActor.ts": "Hook that initializes the backend actor using Internet Identity, handles authentication, and refreshes queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity state and login/logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on equipment, spare parts, cataloguing records, maintenance data, and related backend interactions.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark theme CSS variables for colors, borders, and backgrounds.",
  "frontend/src/lib/cataloguingTemplates.ts": "Stores predefined cataloguing field templates by category and exposes a helper to retrieve template fields.",
  "frontend/src/lib/dates.ts": "Provides helpers to convert bigint timestamps to formatted dates and date strings to bigint nanosecond values.",
  "frontend/src/lib/exports.ts": "Implements basic CSV and PDF export utilities using browser Blob and download links.",
  "frontend/src/lib/validation.ts": "Contains simple validation helpers for required fields, numeric values, and email format.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CataloguingPage.tsx": "Implements the cataloguing record creation/editing UI with equipment selection, dynamic templates, and CRUD mutations.",
  "frontend/src/pages/DocumentsPage.tsx": "UI for uploading, viewing, editing, and deleting equipment documents with progress tracking and dialogs. Uses hooks to fetch and mutate document data tied to selected equipment.",
  "frontend/src/pages/EquipmentListPage.tsx": "Displays all equipment with edit and delete actions, including dialogs and form handling for updating metadata. Fetches equipment list and performs update/delete mutations.",
  "frontend/src/pages/EquipmentMasterPage.tsx": "Form page for creating new equipment records with validation and submit handling. Sends creation requests and resets fields on success.",
  "frontend/src/pages/MaintenancePage.tsx": "Manages maintenance records for selected equipment, including creation, editing, deletion, and status handling. Fetches maintenance list and opens dialogs for updates and confirmations.",
  "frontend/src/pages/ReportsPage.tsx": "Generates equipment, spare parts, and maintenance reports with options to export data to CSV or PDF. Fetches multiple datasets and formats them for export.",
  "frontend/src/pages/SparePartsPage.tsx": "Implements spare parts management UI with create, view-by-equipment, edit, and delete actions using React Query mutations and dialogs.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters with sessionStorage fallback and hash-route support.",
  "frontend/tailwind.config.js": "Configures Tailwind with extended colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Contains project metadata, versioning, and the list of implemented features including edit/delete capabilities across modules."
}