{
  "backend/main.mo": "Motoko canister defining storage mixins, access control, user profiles, and CRUD logic for equipment-related entities with permission checks.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file listing short summaries of various frontend files for reference or documentation.",
  "frontend/index.css": "Tailwind base and theme variable definitions specifying color tokens and styles for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the root div and main TypeScript application module.",
  "frontend/src/App.tsx": "Main React app configuring routes with TanStack Router and wrapping UI with theme and toast providers.",
  "frontend/src/components/AccessControlInitBanner.tsx": "Empty placeholder component file for an access-control initialization banner.",
  "frontend/src/components/ConfirmDialog.tsx": "Reusable confirmation dialog component using shadcn AlertDialog for confirm/cancel prompts.",
  "frontend/src/components/EquipmentLookup.tsx": "Dropdown component that fetches and lists equipment for selection using query hook data.",
  "frontend/src/components/forms/FormField.tsx": "Reusable form field wrapper with label, required indicator, help text, and error display.",
  "frontend/src/components/PageLayout.tsx": "Shared layout component providing header, main content container, and footer with app branding.",
  "frontend/src/hooks/useActor.ts": "Hook that initializes and manages the authenticated or anonymous backend actor and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity state and login flow using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for equipment, spare parts, cataloguing, maintenance, and document operations via an actor backend.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling.",
  "frontend/src/lib/cataloguingTemplates.ts": "Exports predefined cataloguing templates and a function to retrieve fields by template name.",
  "frontend/src/lib/dates.ts": "Utility functions for converting bigint timestamps to readable dates and vice versa.",
  "frontend/src/lib/errors.ts": "Normalizes backend errors into user-friendly messages and detects authentication-related errors.",
  "frontend/src/lib/exports.ts": "Provides CSV and lightweight PDF export utilities for tabular data.",
  "frontend/src/lib/validation.ts": "Simple form validation utilities for required fields, numbers, and email formats.",
  "frontend/src/main.tsx": "Application entry point that mounts React with QueryClient and Internet Identity providers.",
  "frontend/src/pages/CataloguingPage.tsx": "Implements cataloguing record creation, editing, and deletion with template-based attributes and backend mutation hooks.",
  "frontend/src/pages/DocumentsPage.tsx": "UI for uploading, listing, editing, and deleting equipment documents with progress tracking and dialogs.",
  "frontend/src/pages/EquipmentListPage.tsx": "Displays all equipment with edit/delete dialogs and supports updating and removing equipment records.",
  "frontend/src/pages/EquipmentMasterPage.tsx": "Form for creating new equipment records with authentication checks and validation.",
  "frontend/src/pages/MaintenancePage.tsx": "Manages creation, viewing, editing, and deletion of maintenance records tied to selected equipment.",
  "frontend/src/pages/ReportsPage.tsx": "Generates equipment, spare parts, and maintenance reports with CSV/PDF export options.",
  "frontend/src/pages/SparePartsPage.tsx": "React page for viewing, creating, editing, and deleting spare parts tied to selected equipment, with form handling and dialogs. Uses custom query hooks and toast notifications for async mutations.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading and persisting URL parameters, including support for hash-based routing and sessionStorage-backed persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and container settings, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing current issues, existing features, and requirements focused on fixing equipment creation failures and improving authorization error handling."
}