{
  "backend/main.mo": "Main Motoko actor defining data types (Equipment, SparePart, CataloguingRecord, MaintenanceRecord, Document, UserProfile) and storage maps for equipment management, spare parts, cataloguing, maintenance, and documents with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence fixes for null/undefined handling in EquipmentListPage.tsx to prevent 'Cannot read properties of undefined' errors during string operations.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files describing pages, components, hooks, and utilities including equipment management, spare parts, reports, authentication, and data handling with null safety.",
  "frontend/DRAFT_REBUILD_TRIGGER.md": "Marker file with timestamp used to trigger fresh draft builds without modifying application functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the Asset Management App with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for equipment, spare parts, cataloguing, maintenance, documents, reports, import, and global search, wrapped in ThemeProvider and Toaster.",
  "frontend/src/components/AccessControlInitBanner.tsx": "Empty component file for access control initialization banner (no implementation present).",
  "frontend/src/components/AutocompleteTextInput.tsx": "Reusable autocomplete text input with portaled dropdown, keyboard navigation, filtering suggestions, and click-outside handling to prevent clipping issues.",
  "frontend/src/components/ConfirmDialog.tsx": "Reusable confirmation dialog component wrapping AlertDialog with customizable title, description, confirm/cancel buttons, and optional destructive styling.",
  "frontend/src/components/EquipmentLookup.tsx": "A dropdown component for selecting equipment with filtering capabilities by equipment number, tag number, or name. Includes a searchable overlay with scroll area for large equipment lists.",
  "frontend/src/components/EquipmentNameDropdown.tsx": "A dropdown component for equipment names that uses a static list of suggestions and supports free-text input via AutocompleteTextInput.",
  "frontend/src/components/forms/FormField.tsx": "Reusable form field wrapper component that displays label, children input, optional required indicator, help text, and error messages.",
  "frontend/src/components/GlobalSearch.tsx": "Main global search component that searches both equipment and spare parts with filtering, sorting, and debounced search. Persists filter state to sessionStorage and displays results in collapsible sections.",
  "frontend/src/components/GlobalSearchFilters.tsx": "Filter panel component for global search with controls for result type, discipline, equipment type, and date range. Manages FilterState interface and provides default filter values.",
  "frontend/src/components/HeaderAuthControl.tsx": "Authentication control button for the header that handles Internet Identity login/logout with loading states and error handling. Clears query cache on logout.",
  "frontend/src/components/PageLayout.tsx": "Main layout wrapper component with header, navigation, footer, and responsive mobile menu. Includes branding, search navigation, and authentication control.",
  "frontend/src/components/SparePartLookup.tsx": "A dropdown component for selecting spare parts with filtering by part number, name, manufacturer part number, or description. Features a searchable overlay similar to EquipmentLookup.",
  "frontend/src/components/SparePartNameDropdown.tsx": "A dropdown component for spare part names using a static suggestion list and free-text input. Accepts equipmentNumber parameter for API compatibility but doesn't use it for filtering.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useDebounce.ts": "React hook that debounces a value by delaying its update until after a specified delay period has passed without changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and providing login/logout functionality with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on equipment, spare parts, cataloguing records, maintenance records, documents, and user profiles, using the actor from useActor hook.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes using oklch color space.",
  "frontend/src/lib/cataloguingTemplates.ts": "Defines cataloguing templates for different engineering disciplines (mechanical, electrical, instrumentation, piping) with predefined field configurations for equipment data entry.",
  "frontend/src/lib/csvImport.ts": "CSV parsing utilities with validation functions for equipment and spare part rows, plus helper functions for parsing dates and bigints from CSV data.",
  "frontend/src/lib/dates.ts": "Utility functions for converting between bigint nanosecond timestamps and formatted date strings or Date objects.",
  "frontend/src/lib/disciplines.ts": "Defines engineering discipline options and provides conversion functions between EngineeringDiscipline enum values and human-readable labels.",
  "frontend/src/lib/errors.ts": "Error normalization utilities that extract user-friendly messages from backend errors, including special handling for canister trap errors, authentication errors, and backend configuration mismatches.",
  "frontend/src/lib/exports.ts": "Provides functions to export data to CSV and PDF formats, and download CSV templates. Includes manual PDF generation using raw PDF syntax.",
  "frontend/src/lib/files.ts": "Utility functions for converting browser File objects to ExternalBlob format with upload progress tracking, and formatting file sizes for display.",
  "frontend/src/lib/filtering.ts": "Implements filtering logic for equipment and spare parts based on discipline, equipment type, and date range criteria.",
  "frontend/src/lib/importMappings.ts": "Defines CSV import templates and mapping functions to convert CSV row data into Equipment and SparePart objects with flexible column name matching.",
  "frontend/src/lib/productionChecks.ts": "Runtime validation functions to verify backend canister has required methods deployed, helping diagnose production configuration issues.",
  "frontend/src/lib/sorting.ts": "Implements sorting logic for equipment and spare parts by relevance, name, number, or date with configurable direction and relevance scoring.",
  "frontend/src/lib/staticNameLists.ts": "Provides static sorted lists of common equipment and spare part names for autocomplete dropdown suggestions.",
  "frontend/src/lib/validation.ts": "Basic validation functions for required fields, numeric values, and email addresses, returning error messages or null.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/CataloguingPage.tsx": "Placeholder page displaying a feature-not-available message for the cataloguing functionality that requires unimplemented backend methods.",
  "frontend/src/pages/DocumentsPage.tsx": "Placeholder page displaying a feature-not-available message for the documents functionality that requires unimplemented backend methods.",
  "frontend/src/pages/EquipmentListPage.tsx": "Main equipment list view with search, filtering by discipline, and inline editing/deletion capabilities with authentication checks. Content is truncated.",
  "frontend/src/pages/EquipmentMasterPage.tsx": "Main equipment creation page with form for entering equipment details (name, tag number, location, manufacturer, etc.) and navigation to related features. Handles authentication, form validation, and equipment creation with error handling for backend configuration issues.",
  "frontend/src/pages/GlobalSearchPage.tsx": "Page wrapper for the GlobalSearch component that displays search interface for equipment and spare parts. Shows authentication requirement alert when user is not logged in.",
  "frontend/src/pages/ImportPage.tsx": "CSV import page supporting bulk equipment and spare parts creation with file upload, preview, validation, and batch processing. Includes template download functionality and tracks actor initialization status with error handling.",
  "frontend/src/pages/MaintenancePage.tsx": "Placeholder page for maintenance records feature that displays a 'not available' message indicating required backend methods (createMaintenanceRecord, deleteMaintenanceRecord) are not yet implemented.",
  "frontend/src/pages/ReportsPage.tsx": "Reports dashboard with tabs for equipment list, spare parts, and maintenance due reports. Provides CSV and PDF export functionality for each report type with equipment lookup integration.",
  "frontend/src/pages/SparePartsPage.tsx": "Comprehensive spare parts management page supporting creation (new or linking existing), viewing by equipment, editing, deletion, and search functionality. Includes file attachment handling and equipment usage tracking.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, container settings, custom fonts (Inter), border radius variables, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata tracking a fix request for a 'Cannot read properties of undefined (reading 'replace')' error in the equipment list view, with two existing features focused on adding null/undefined checks to equipment data fields in EquipmentListPage.tsx."
}