{
  "backend/main.mo": "Defines equipment, spare parts, cataloguing, maintenance, documents, and user profile types with storage maps and authorization, plus comparison functions and utilities for disciplines.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file including pages, components, hooks, utilities, and styles.",
  "frontend/index.css": "Tailwind CSS setup defining OKLCH color variables for light and dark themes and applying base styles.",
  "frontend/index.html": "Root HTML file that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for all pages and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/AccessControlInitBanner.tsx": "Empty placeholder component file.",
  "frontend/src/components/ConfirmDialog.tsx": "Reusable confirmation dialog component built on AlertDialog with customizable actions.",
  "frontend/src/components/EquipmentLookup.tsx": "Dropdown component with type-to-filter search for selecting equipment by number, tag, or name.",
  "frontend/src/components/forms/FormField.tsx": "Wrapper component for labeled form fields with required markers, help text, and error display.",
  "frontend/src/components/PageLayout.tsx": "Provides shared layout with header, footer, and main content container.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, recreating it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context with login, logout, and stored identity restoration using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating equipment and related data through the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables, themes, and base styles for light and dark modes.",
  "frontend/src/lib/cataloguingTemplates.ts": "Defines discipline-specific cataloguing field templates and a helper to retrieve template fields.",
  "frontend/src/lib/csvImport.ts": "Provides CSV parsing, validation helpers for equipment and spare parts rows, and utilities to parse dates and BigInts.",
  "frontend/src/lib/dates.ts": "Converts bigint timestamps to formatted dates and vice versa.",
  "frontend/src/lib/disciplines.ts": "Maps engineering discipline enums to labels and back, plus predefined discipline options.",
  "frontend/src/lib/errors.ts": "Normalizes backend errors into user-friendly messages and detects authentication-related errors.",
  "frontend/src/lib/exports.ts": "Provides CSV and basic PDF export utilities plus CSV template download generation.",
  "frontend/src/lib/files.ts": "Converts browser File objects to ExternalBlob with optional progress and formats file sizes.",
  "frontend/src/lib/importMappings.ts": "Defines CSV headers and maps equipment and spare part CSV rows into structured backend-ready objects.",
  "frontend/src/lib/validation.ts": "Simple validators for required fields, numeric input, and email formatting.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/CataloguingPage.tsx": "UI for creating, editing, and deleting cataloguing records tied to equipment with form handling and queries.",
  "frontend/src/pages/DocumentsPage.tsx": "Manages equipment documents including upload with progress, metadata editing, and deletion.",
  "frontend/src/pages/EquipmentListPage.tsx": "Displays, filters, edits, and deletes equipment records with search and discipline filtering.",
  "frontend/src/pages/EquipmentMasterPage.tsx": "Form page for creating equipment records, handling validation, authentication, and submission via createEquipment API.",
  "frontend/src/pages/ImportPage.tsx": "CSV import interface for equipment and spare parts with preview, validation, mutation calls, and result reporting.",
  "frontend/src/pages/MaintenancePage.tsx": "CRUD interface for maintenance records tied to selected equipment, including creation, editing, deletion, and listing.",
  "frontend/src/pages/ReportsPage.tsx": "Reporting page that fetches equipment, spare parts, and maintenance data and exports them to CSV or PDF.",
  "frontend/src/pages/SparePartsPage.tsx": "Management page for spare parts with creation, editing, deletion, file attachments, equipment linking, and search.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, fonts, animations, and plugin usage.",
  "project_state.json": "Project state metadata describing current features, pending feature requests, and versioning for an equipment management app."
}