{
  "backend/main.mo": "Main canister actor defining equipment, spare parts, cataloguing, maintenance, documents, and user profile types with storage maps and authorization mixins.",
  "backend/migration.mo": "Migration module converting old actor data structures into the new ones with added fields like discipline and additionalInformation.",
  "feature_evidence.json": "Feature evidence report listing features, related frontend files, components, and test IDs for recent enhancements.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files describing their purpose and behavior.",
  "frontend/index.css": "Tailwind CSS base and theme variables defining color tokens and dark mode styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/AccessControlInitBanner.tsx": "Empty placeholder component file.",
  "frontend/src/components/ConfirmDialog.tsx": "Reusable confirmation dialog component built with alert-dialog primitives.",
  "frontend/src/components/EquipmentLookup.tsx": "Dropdown component that loads all equipment and allows selecting one by equipment number.",
  "frontend/src/components/forms/FormField.tsx": "Reusable form field wrapper handling labels, errors, help text, and child inputs.",
  "frontend/src/components/PageLayout.tsx": "Defines the main application layout with header, footer, and a content container.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity, invalidating queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login handling, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for CRUD operations on equipment, spare parts, and related backend resources.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining light and dark theme color tokens.",
  "frontend/src/lib/cataloguingTemplates.ts": "Provides predefined cataloguing templates and a helper to retrieve template fields by name.",
  "frontend/src/lib/dates.ts": "Utilities for converting between bigint timestamps and formatted date strings.",
  "frontend/src/lib/disciplines.ts": "Maps engineering discipline enums to labels and vice versa.",
  "frontend/src/lib/errors.ts": "Normalizes backend errors into readable messages and detects authentication-related errors.",
  "frontend/src/lib/exports.ts": "Exports tabular data to CSV or PDF using manual PDF construction.",
  "frontend/src/lib/files.ts": "Converts browser files to ExternalBlob objects and formats file sizes.",
  "frontend/src/lib/validation.ts": "Provides basic validation helpers for required fields, numbers, and email formats.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/CataloguingPage.tsx": "Implements cataloguing record creation, editing, and deletion with template‑based attribute handling.",
  "frontend/src/pages/DocumentsPage.tsx": "Handles uploading, viewing, editing metadata, and deleting documents linked to equipment.",
  "frontend/src/pages/EquipmentListPage.tsx": "Displays equipment list and supports editing and deleting equipment records.",
  "frontend/src/pages/EquipmentMasterPage.tsx": "Provides a form for creating new equipment records with authentication checks.",
  "frontend/src/pages/MaintenancePage.tsx": "Manages creation, viewing, editing, and deletion of maintenance records for equipment.",
  "frontend/src/pages/ReportsPage.tsx": "Renders reports for equipment, spare parts, and maintenance with CSV/PDF export functions and data fetched via React Query hooks.",
  "frontend/src/pages/SparePartsPage.tsx": "Manages spare parts creation, editing, deletion, search, and file attachments with dialogs and equipment lookup.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters with hash-routing support.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for the frontend UI.",
  "project_state.json": "Tracks project state, features, and pending requests related to adding additionalInformation and discipline fields across the app."
}