{
  "kind": "build_request",
  "title": "Automatic equipment number generation and enhanced equipment search",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Expose the next auto-generated equipment number from the backend so the frontend can display it before equipment creation.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "there should be automatics equipment number generation and search option for equipment also"
        ]
      },
      "acceptanceCriteria": [
        "Backend provides a new authenticated query method (user permission) that returns the next equipment number that would be assigned on create.",
        "Calling the new method does not modify any existing equipment data or counters.",
        "Unauthorized callers receive the same style of authorization failure as other equipment APIs."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Equipment Master (create equipment) UI to clearly indicate that the equipment number is generated automatically and show the next number to the user.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "there should be automatics equipment number generation and search option for equipment also"
        ]
      },
      "acceptanceCriteria": [
        "The create-equipment form shows an \"Equipment # (auto-generated)\" field that is read-only/disabled.",
        "The displayed value is fetched from the backend and updates appropriately after a successful create (so the next number increments).",
        "After creating equipment, the success toast/message includes the created equipment number returned by the backend."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add an equipment search capability on the Equipment List page with expanded search options across multiple fields.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-0",
          "msg-1"
        ],
        "quotes": [
          "Yes and i need search option in equipment also, and search options should me more",
          "there should be automatics equipment number generation and search option for equipment also"
        ]
      },
      "acceptanceCriteria": [
        "Equipment List page includes a search input that filters the table results without requiring a page reload.",
        "Search can match at least: equipment number, equipment tag number, name, location, manufacturer, model, and serial number.",
        "A discipline filter is available (e.g., dropdown) and can be combined with the text search.",
        "When no records match the search/filter criteria, the page shows a clear empty state (English text) distinct from the initial \"no equipment records\" state."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Improve equipment selection UX wherever the EquipmentLookup dropdown is used by adding a basic search/filter for equipment options.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-0",
          "msg-1"
        ],
        "quotes": [
          "i need search option in equipment also, and search options should me more",
          "search option for equipment also"
        ]
      },
      "acceptanceCriteria": [
        "EquipmentLookup UI provides a way to type to filter the equipment options (by equipment number, tag number, and name).",
        "Filtering does not change the selected equipment value unless the user explicitly selects a different option.",
        "When the filter yields no matches, the UI indicates that no equipment matched the filter (English text)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any path listed in frontend.immutablePaths; compose existing UI components instead.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Add export functionality.",
    "Add third-party authentication providers (only Internet Identity is supported).",
    "Introduce external databases or non-Motoko backend code."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}