{
  "kind": "build_request",
  "title": "Fix equipment creation failure (\"Failed to create equipment\")",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the root cause of equipment creation failing so a signed-in user can successfully create equipment records via backend createEquipment without receiving an authorization trap or other error.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "I CNNOT SAVE EQUIPMENT IT OS SHOWING ME FAILED TO CREATE EQUIPMENT"
        ]
      },
      "acceptanceCriteria": [
        "When a user is authenticated with Internet Identity, submitting the Equipment Master form successfully creates an equipment record and returns a new equipmentNumber.",
        "The equipment record appears in the Equipment List after creation (without requiring a hard refresh).",
        "Creating equipment does not fail due to missing/incorrect access-control initialization for normal authenticated users.",
        "Anonymous (not signed-in) users cannot create equipment and receive a clear, non-generic error message in the UI (see REQ-2)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Improve frontend error handling for equipment creation so the toast shows the real underlying error (e.g., unauthorized vs. other backend traps) instead of always showing only \"Failed to create equipment\", and guide the user to sign in when the error is authentication/authorization related.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "I CNNOT SAVE EQUIPMENT IT OS SHOWING ME FAILED TO CREATE EQUIPMENT"
        ]
      },
      "acceptanceCriteria": [
        "If createEquipment fails, the UI displays an error toast that includes a specific reason when available (e.g., \"Unauthorized: Only users can create equipment\").",
        "If the user is not authenticated (anonymous actor), the Equipment Master page prevents submission and displays a clear English message indicating the user must sign in to save equipment.",
        "The existing success toast and form reset behavior remains unchanged on successful creation."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Harden actor/access-control initialization so failures in the access-control initialization step do not silently break mutations; surface initialization failures to the UI and ensure the app can recover after login/logout changes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "FAILED TO CREATE EQUIPMENT"
        ]
      },
      "acceptanceCriteria": [
        "If the call that initializes access control during actor creation fails, the app shows a user-facing English error indicating initialization failed and prompts the user to retry/login again.",
        "After login/logout, queries and mutations use the correct actor for the current identity (no stale actor causing authorization failures)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts or other paths listed in frontend.immutablePaths.",
    "Keep all backend logic in the single Motoko actor (backend/main.mo); add backend/migration.mo only if state schema changes require migration."
  ],
  "nonGoals": [
    "Adding new equipment fields or changing the equipment data model beyond what is required to fix the save failure.",
    "Implementing third-party authentication providers (only Internet Identity is supported).",
    "Adding real-time updates or websocket-based synchronization."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}