{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Additional Information field to all create/edit UIs and Discipline dropdown in Equipment Master",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Add an \"Additional Information\" multiline textarea to each record create/edit UI and persist it via backend calls.",
      "acceptanceCriteria": [
        "Each create/edit form for Equipment, Spare Parts, Cataloguing records, Maintenance records, and Documents includes a labeled textarea: \"Additional Information\"",
        "Submitting any create/edit form persists the Additional Information text and it is visible after reload/refetch",
        "Existing UI behavior remains unchanged when Additional Information is left blank",
        "All user-facing labels/placeholder text are in English"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/EquipmentMasterPage.tsx",
          "operation": "modify",
          "description": "Add an \"Additional Information\" textarea to the equipment creation form, store it in local form state, and include it in the create-equipment mutation payload. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/EquipmentListPage.tsx",
          "operation": "modify",
          "description": "Add an \"Additional Information\" textarea to the equipment edit dialog, prefill from the selected equipment record, and include it in the update-equipment mutation payload. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/SparePartsPage.tsx",
          "operation": "modify",
          "description": "Add an \"Additional Information\" textarea to the spare part create form and edit dialog, bind to form state, and include it in create/update mutation payloads while keeping current attachment behavior unchanged. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/CataloguingPage.tsx",
          "operation": "modify",
          "description": "Add an \"Additional Information\" textarea to cataloguing create/edit form state and include it in create/update mutation payloads (draft/submitted flows unchanged). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/MaintenancePage.tsx",
          "operation": "modify",
          "description": "Add an \"Additional Information\" textarea to maintenance create form and edit dialog, bind to state, and include it in create/update mutation payloads. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/DocumentsPage.tsx",
          "operation": "modify",
          "description": "Add an \"Additional Information\" textarea to document upload metadata and document metadata edit UI; include the field in upload and metadata update mutation payloads while preserving existing file upload behavior. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add a Discipline dropdown to equipment create/edit/list flows and persist discipline through frontend mutations and queries.",
      "acceptanceCriteria": [
        "Equipment Master page includes a select/dropdown labeled \"Discipline\" with the four options exactly as provided",
        "Creating equipment sends the selected discipline to the backend and it is returned on subsequent fetches",
        "Equipment list/edit UI surfaces the discipline value for existing equipment (including blank for legacy/migrated records)",
        "All user-facing text is in English"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/disciplines.ts",
          "operation": "create",
          "description": "Add a small shared utility/constants module for the allowed discipline UI options (MECHANICAL, ELECTRICAL, INSTRUMENTATION, PIPING) and mapping to/from the backend EngineeringDiscipline enum values used by the actor. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/EquipmentMasterPage.tsx",
          "operation": "modify",
          "description": "Add a \"Discipline\" select/dropdown to the equipment creation form with options exactly: MECHANICAL, ELECTRICAL, INSTRUMENTATION, PIPING; default to blank for legacy/unspecified; map selected UI value to backend EngineeringDiscipline in the create mutation payload. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/EquipmentListPage.tsx",
          "operation": "modify",
          "description": "Display discipline in the equipment list table (e.g., a new column) and add a Discipline select/dropdown in the edit dialog; prefill from the selected equipment, allow blank, and persist changes through the update mutation payload using the backend enum mapping. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Update React Query hooks and backend type usage so all relevant queries/mutations include additionalInformation and discipline with no TS/runtime mismatches.",
      "acceptanceCriteria": [
        "Frontend builds successfully with no TypeScript errors related to backend types or actor method signatures",
        "All affected hooks (create/update for equipment, spare parts, cataloguing, maintenance, documents) pass the new fields",
        "Queries/refetches continue to work and UI updates after mutations as before"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update equipment/spare part/cataloguing/maintenance/document mutations to match the backend actor signatures by including the new additionalInfo parameter for all relevant create/update operations, and including discipline for equipment create/update operations; ensure TypeScript types line up with frontend/src/backend.d.ts. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/EquipmentMasterPage.tsx",
          "operation": "modify",
          "description": "Align the create-equipment call site with updated hook parameter shape (additionalInformation + discipline) and ensure blank values submit safely (empty string / unknown mapping) without changing existing validation rules. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/EquipmentListPage.tsx",
          "operation": "modify",
          "description": "Align the update-equipment call site with updated hook parameter shape (additionalInformation + discipline) and ensure legacy records with blank/unknown discipline render without crashing. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/SparePartsPage.tsx",
          "operation": "modify",
          "description": "Align spare part create/update call sites with updated hook parameter shape including additionalInformation, keeping all existing invalidations and UI flows intact. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/CataloguingPage.tsx",
          "operation": "modify",
          "description": "Align cataloguing create/update call sites with updated hook parameter shape including additionalInformation, keeping draft/submitted behavior intact. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/MaintenancePage.tsx",
          "operation": "modify",
          "description": "Align maintenance create/update call sites with updated hook parameter shape including additionalInformation, keeping status/date handling intact. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/DocumentsPage.tsx",
          "operation": "modify",
          "description": "Align document upload and metadata update call sites with updated hook parameter shape including additionalInformation, ensuring refetch/invalidation behavior remains unchanged. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}