{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix equipment creation auth/init failures and surface actionable UI errors",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure authenticated users can create equipment successfully by preventing access-control initialization failures from breaking actor usage and by ensuring equipment lists update after creation.",
      "acceptanceCriteria": [
        "When a user is authenticated with Internet Identity, submitting the Equipment Master form successfully creates an equipment record and returns a new equipmentNumber.",
        "The equipment record appears in the Equipment List after creation (without requiring a hard refresh).",
        "Creating equipment does not fail due to missing/incorrect access-control initialization for normal authenticated users.",
        "Anonymous (not signed-in) users cannot create equipment and receive a clear, non-generic error message in the UI (see REQ-2)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Adjust actor creation so access-control initialization (authorization component initialization via the actor’s access-control init call) is non-blocking for normal authenticated users (e.g., only attempt secret-based initialization when a secret is present and/or capture failures instead of breaking actor availability). Expose an actor initialization status/error for UI consumption. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden equipment creation mutation behavior to ensure the equipment list queries are refreshed after successful creation (invalidate + refetch relevant queries so the list updates without a hard refresh) and propagate underlying errors upward so the UI can display specific messages."
        },
        {
          "path": "frontend/src/pages/EquipmentListPage.tsx",
          "operation": "modify",
          "description": "Ensure the Equipment List view reacts to refreshed query data after creation (no hard refresh needed) and optionally display a lightweight loading/refresh state when the underlying equipment query refetches."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Improve equipment creation error handling to show the real underlying error and guide users to sign in when unauthenticated/unauthorized.",
      "acceptanceCriteria": [
        "If createEquipment fails, the UI displays an error toast that includes a specific reason when available (e.g., \"Unauthorized: Only users can create equipment\").",
        "If the user is not authenticated (anonymous actor), the Equipment Master page prevents submission and displays a clear English message indicating the user must sign in to save equipment.",
        "The existing success toast and form reset behavior remains unchanged on successful creation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/errors.ts",
          "operation": "create",
          "description": "Add a small utility to normalize/parse errors from backend calls into a user-friendly English message (e.g., extracting trap messages / unauthorized text) so toasts can display specific reasons."
        },
        {
          "path": "frontend/src/pages/EquipmentMasterPage.tsx",
          "operation": "modify",
          "description": "Use Internet Identity state (via existing auth context) to prevent submission when the user is not signed in, showing a clear English message near the submit action. On mutation failure, use the shared error-normalization utility to show a specific toast message (and include sign-in guidance when the message indicates authentication/authorization). Keep the existing success toast and form reset behavior unchanged on success."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Surface access-control initialization failures to the UI and ensure actor refresh/recovery after login/logout so mutations don’t use a stale or incorrectly initialized actor.",
      "acceptanceCriteria": [
        "If the call that initializes access control during actor creation fails, the app shows a user-facing English error indicating initialization failed and prompts the user to retry/login again.",
        "After login/logout, queries and mutations use the correct actor for the current identity (no stale actor causing authorization failures)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Return additional state from useActor (e.g., initializationError and a retry method that resets the actor query) and ensure identity changes reliably recreate the actor and invalidate/refetch dependent queries without leaving a stale actor in place."
        },
        {
          "path": "frontend/src/components/AccessControlInitBanner.tsx",
          "operation": "create",
          "description": "Create a small UI component that reads useActor initialization status and, when initialization fails, renders an English error message with a retry/login-again prompt. (Uses existing UI patterns; shadcn-ui can be used for consistent styling. Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new AccessControlInitBanner into the root layout so initialization failures are visible across pages and the app can guide the user to retry or re-authenticate."
        }
      ]
    }
  ]
}